data/Parm_PH_29/alpha_05/alpha_05_4071_4048/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
15600
(
(0.0210701554105854 1.0019553158389 4.28271454389253e-18)
(0.0631504809359917 1.00067183630324 2.243348854143e-18)
(0.104400002182897 0.993671708935738 4.64206873794657e-18)
(0.142659033340636 0.977128168442014 -2.47932285915157e-18)
(0.175953982400272 0.951810432453228 5.84406595959696e-18)
(0.204624223540433 0.921072740039714 1.58996389802674e-18)
(0.230267551793999 0.887689177309776 -3.34702438800418e-18)
(0.254032267617541 0.852922230993679 -3.31132049160555e-18)
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.0210782029096729 1 0)
(0.0631672268864217 0.998714446529939 0)
(0.104406063859644 0.991709236848229 0)
(0.142645191041785 0.97516045166527 0)
(0.175919729239806 0.949832161195367 0)
(0.204572548443908 0.91906376767944 0)
(0.230198349223924 0.885632683219264 0)
(0.253944452591259 0.850807121933699 0)
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.0169625 4.048 0)
(0.0508875 4.048 0)
(0.0848125 4.048 0)
(0.1187375 4.048 0)
(0.1526625 4.048 0)
(0.1865875 4.048 0)
(0.2205125 4.048 0)
(0.2544375 4.048 0)
...
)
;
    }
    inlet_half0
    {
        type            cyclic;
    }
    inlet_half1
    {
        type            cyclic;
    }
    outlet_half0
    {
        type            cyclic;
    }
    outlet_half1
    {
        type            cyclic;
    }
    sideRight_half0
    {
        type            empty;
    }
    sideRight_half1
    {
        type            empty;
    }
    sideLeft_half0
    {
        type            empty;
    }
    sideLeft_half1
    {
        type            empty;
    }
}


// ************************************************************************* //
