data/Parm_PH_29/alpha_05/alpha_05_4071_4048/0/tauij_LES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      tauij_LES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor>
15600
(
(0.00632894 -0.00017117 0.00000000 0.00004591 0.00000000 0.00372787)
(0.00522134 -0.00012992 0.00000000 0.00002643 0.00000000 0.00262104)
(0.00050247 -0.00000846 0.00000000 -0.00000573 0.00000000 0.00012520)
(0.00006623 -0.00005240 0.00000000 0.00003810 0.00000000 0.00018219)
(0.00008139 -0.00006389 0.00000000 0.00004748 0.00000000 0.00019006)
(0.00001376 -0.00002751 0.00000000 0.00005393 0.00000000 0.00018599)
(0.00000435 0.00000165 0.00000000 -0.00001055 0.00000000 0.00008071)
(0.00000850 -0.00000442 0.00000000 -0.00000283 0.00000000 0.00004242)
...
)
;

boundaryField
{
    bottomWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    topWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    inlet_half0
    {
        type        cyclic;
    }
    inlet_half1
    {
        type        cyclic;
    }
    outlet_half0
    {
        type        cyclic;
    }
    outlet_half1
    {
        type        cyclic;
    }
    sideRight_half0
    {
        type        empty;
    }
    sideRight_half1
    {
        type        empty;
    }
    sideLeft_half0
    {
        type        empty;
    }
    sideLeft_half1
    {
        type        empty;
    }
}

// ************************************************************************* //
